{
    "Allow to transfer errors if the adapter crash. Private data like usernames, passwords, tokens, ... will be NOT be transferd.": "Permita transferir errores si el adaptador falla. NO se transferirán datos privados como nombres de usuario, contraseñas, tokens, ...",
    "Auto update of new firmware": "Actualización automática de nuevo firmware",
    "COAP listen IP": "IP de escucha COAP",
    "CoAP and HTTP": "CoAP y HTTP",
    "CoAP settings": "Configuraciones de CoAP",
    "Default QoS": "QoS predeterminada",
    "General settings": "Configuración general",
    "HTTP Password": "Contraseña HTTP",
    "HTTP Username": "Nombre de usuario HTTP",
    "Http Username and Http Password in section RESTRICTED LOGIN on your Shelly device": "Nombre de usuario y contraseña de HTTP en la sección RESTRICTED LOGIN en su dispositivo Shelly",
    "MQTT Listen IP": "MQTT Listen IP",
    "MQTT Password": "Contraseña MQTT",
    "MQTT Username": "Nombre de usuario de MQTT",
    "MQTT and HTTP": "MQTT y HTTP",
    "MQTT settings": "Configuraciones MQTT",
    "Poll time in seconds": "Tiempo de encuesta en segundos",
    "Shelly devices that shall not be displayed. Enter device id of Shelly like 8B22BD": "Dispositivos de Shelly que no se mostrarán .. Ingrese el ID de dispositivo de Shelly como 8B22BD",
    "Shelly protocol": "Protocolo shelly",
    "Update objects even if there is no value change": "Actualizar objetos incluso si no hay cambio de valor",
    "Log Debug Messages": "Registrar mensajes de depuración",
    "You have to configure the same password on all devices": "Tienes que configurar la misma contraseña en todos los dispositivos",
    "Save HTTP responses (for debugging)": "Guardar respuestas HTTP (para depuración)",
    "CoAP ist supported by Gen1 devices, MQTT is supported by all devices (Gen1 and Gen2)": "CoAP es compatible con dispositivos Gen1, MQTT es compatible con todos los dispositivos (Gen1 y Gen2)",
    "Must be configured on all Shelly devices": "Debe configurarse en todos los dispositivos Shelly",
    "Will be used to authenticate against generation 1 devices": "Se usará para autenticarse en dispositivos de generación 1",
    "User credentials for restricted login": "Credenciales de usuario para inicio de sesión restringido",
    "Custom options": "Opciones personalizadas",
    "Debugging (expert options)": "Depuración (opciones de experto)",
    "MQTT Server options": "Opciones del servidor MQTT"
}
