{
    "Allow to transfer errors if the adapter crash. Private data like usernames, passwords, tokens, ... will be NOT be transferd.": "Zezwól na przesyłanie błędów w przypadku awarii adaptera. Prywatne dane, takie jak nazwy użytkowników, hasła, tokeny, ... NIE zostaną przeniesione.",
    "Auto update of new firmware": "Automatyczna aktualizacja nowego oprogramowania układowego",
    "COAP listen IP": "COAP nasłuchuje IP",
    "CoAP and HTTP": "CoAP i HTTP",
    "CoAP settings": "Ustawienia CoAP",
    "Default QoS": "Domyślna usługa QoS",
    "General settings": "Ustawienia główne",
    "HTTP Password": "Hasło HTTP",
    "HTTP Username": "Nazwa użytkownika HTTP",
    "Http Username and Http Password in section RESTRICTED LOGIN on your Shelly device": "Nazwa użytkownika i hasło HTTP w sekcji RESTRICTED LOGIN na urządzeniu Shelly",
    "MQTT Listen IP": "MQTT Słuchaj IP",
    "MQTT Password": "Hasło MQTT",
    "MQTT Username": "Nazwa użytkownika MQTT",
    "MQTT and HTTP": "MQTT i HTTP",
    "MQTT settings": "Ustawienia MQTT",
    "Poll time in seconds": "Czas ankiety w sekundach",
    "Shelly devices that shall not be displayed. Enter device id of Shelly like 8B22BD": "Urządzenia Shelly, które nie będą wyświetlane. Wpisz identyfikator urządzenia Shelly, taki jak 8B22BD",
    "Shelly protocol": "Protokół Shelly",
    "Update objects even if there is no value change": "Aktualizuj obiekty, nawet jeśli nie ma zmiany wartości",
    "Log Debug Messages": "Zapisuj komunikaty debugowania",
    "You have to configure the same password on all devices": "Musisz skonfigurować to samo hasło na wszystkich urządzeniach",
    "Save HTTP responses (for debugging)": "Zapisz odpowiedzi HTTP (do debugowania)",
    "CoAP ist supported by Gen1 devices, MQTT is supported by all devices (Gen1 and Gen2)": "CoAP jest obsługiwany przez urządzenia Gen1, MQTT jest obsługiwany przez wszystkie urządzenia (Gen1 i Gen2)",
    "Must be configured on all Shelly devices": "Musi być skonfigurowany na wszystkich urządzeniach Shelly",
    "Will be used to authenticate against generation 1 devices": "Będzie używany do uwierzytelniania na urządzeniach 1. generacji",
    "User credentials for restricted login": "Poświadczenia użytkownika do ograniczonego logowania",
    "Custom options": "Opcje niestandardowe",
    "Debugging (expert options)": "Debugowanie (opcje eksperckie)",
    "MQTT Server options": "Opcje serwera MQTT"
}
