{
    "Allow to transfer errors if the adapter crash. Private data like usernames, passwords, tokens, ... will be NOT be transferd.": "Разрешить передавать ошибки в случае сбоя адаптера. Личные данные, такие как имена пользователей, пароли, токены, ... НЕ будут передаваться.",
    "Auto update of new firmware": "Автообновление новой прошивки",
    "COAP listen IP": "COAP слушает IP",
    "CoAP and HTTP": "CoAP и HTTP",
    "CoAP settings": "Настройки CoAP",
    "Default QoS": "QoS по умолчанию",
    "General settings": "Общие настройки",
    "HTTP Password": "HTTP-пароль",
    "HTTP Username": "Имя пользователя HTTP",
    "Http Username and Http Password in section RESTRICTED LOGIN on your Shelly device": "Имя пользователя и пароль Http в разделе RESTRICTED LOGIN на вашем устройстве Shelly",
    "MQTT Listen IP": "MQTT Listen IP",
    "MQTT Password": "MQTT пароль",
    "MQTT Username": "Имя пользователя MQTT",
    "MQTT and HTTP": "MQTT и HTTP",
    "MQTT settings": "Настройки MQTT",
    "Poll time in seconds": "Время опроса в секундах",
    "Shelly devices that shall not be displayed. Enter device id of Shelly like 8B22BD": "Устройства Шелли, которые не должны отображаться. Введите идентификатор устройства Шелли, например 8B22BD",
    "Shelly protocol": "Протокол Шелли",
    "Update objects even if there is no value change": "Обновлять объекты, даже если нет изменения значения",
    "Log Debug Messages": "Журнал отладочных сообщений",
    "You have to configure the same password on all devices": "Вы должны настроить один и тот же пароль на всех устройствах",
    "Save HTTP responses (for debugging)": "Сохранять ответы HTTP (для отладки)",
    "CoAP ist supported by Gen1 devices, MQTT is supported by all devices (Gen1 and Gen2)": "CoAP поддерживается устройствами Gen1, MQTT поддерживается всеми устройствами (Gen1 и Gen2).",
    "Must be configured on all Shelly devices": "Должен быть настроен на всех устройствах Shelly",
    "Will be used to authenticate against generation 1 devices": "Будет использоваться для аутентификации на устройствах первого поколения.",
    "User credentials for restricted login": "Учетные данные пользователя для ограниченного входа",
    "Custom options": "Пользовательские параметры",
    "Debugging (expert options)": "Отладка (экспертные опции)",
    "MQTT Server options": "Параметры MQTT-сервера"
}
