{
    "Allow to transfer errors if the adapter crash. Private data like usernames, passwords, tokens, ... will be NOT be transferd.": "Consentire il trasferimento degli errori in caso di arresto anomalo dell'adattatore. I dati privati come nomi utente, password, token, ... NON saranno trasferiti.",
    "Auto update of new firmware": "Aggiornamento automatico del nuovo firmware",
    "COAP listen IP": "IP di ascolto COAP",
    "CoAP and HTTP": "CoAP e HTTP",
    "CoAP settings": "Impostazioni CoAP",
    "Default QoS": "QoS predefinito",
    "General settings": "Impostazioni generali",
    "HTTP Password": "Password HTTP",
    "HTTP Username": "Nome utente HTTP",
    "Http Username and Http Password in section RESTRICTED LOGIN on your Shelly device": "Http Username e Http Password nella sezione RESTRICTED LOGIN sul tuo dispositivo Shelly",
    "MQTT Listen IP": "MQTT Ascolta IP",
    "MQTT Password": "Password MQTT",
    "MQTT Username": "Nome utente MQTT",
    "MQTT and HTTP": "MQTT e HTTP",
    "MQTT settings": "Impostazioni MQTT",
    "Poll time in seconds": "Tempo del sondaggio in secondi",
    "Shelly devices that shall not be displayed. Enter device id of Shelly like 8B22BD": "Dispositivi Shelly che non devono essere visualizzati. Immettere l'ID del dispositivo di Shelly come 8B22BD",
    "Shelly protocol": "Protocollo Shelly",
    "Update objects even if there is no value change": "Aggiorna gli oggetti anche se non c'è alcun cambiamento di valore",
    "Log Debug Messages": "Registra i messaggi di debug",
    "You have to configure the same password on all devices": "Devi configurare la stessa password su tutti i dispositivi",
    "Save HTTP responses (for debugging)": "Salva le risposte HTTP (per il debug)",
    "CoAP ist supported by Gen1 devices, MQTT is supported by all devices (Gen1 and Gen2)": "CoAP è supportato dai dispositivi Gen1, MQTT è supportato da tutti i dispositivi (Gen1 e Gen2)",
    "Must be configured on all Shelly devices": "Deve essere configurato su tutti i dispositivi Shelly",
    "Will be used to authenticate against generation 1 devices": "Verrà utilizzato per l'autenticazione rispetto ai dispositivi di prima generazione",
    "User credentials for restricted login": "Credenziali utente per accesso limitato",
    "Custom options": "Opzioni personalizzate",
    "Debugging (expert options)": "Debug (opzioni per esperti)",
    "MQTT Server options": "Opzioni del server MQTT"
}
