{
    "Allow to transfer errors if the adapter crash. Private data like usernames, passwords, tokens, ... will be NOT be transferd.": "Permet de transférer des erreurs en cas de panne de l'adaptateur. Les données privées comme les noms d'utilisateur, les mots de passe, les jetons, ... ne seront PAS transférées.",
    "Auto update of new firmware": "Mise à jour automatique du nouveau firmware",
    "COAP listen IP": "COAP écoute IP",
    "CoAP and HTTP": "CoAP et HTTP",
    "CoAP settings": "Paramètres CoAP",
    "Default QoS": "QoS par défaut",
    "General settings": "Réglages généraux",
    "HTTP Password": "Mot de passe HTTP",
    "HTTP Username": "Nom d'utilisateur HTTP",
    "Http Username and Http Password in section RESTRICTED LOGIN on your Shelly device": "Nom d'utilisateur et mot de passe HTTP dans la section RESTRICTED LOGIN sur votre appareil Shelly",
    "MQTT Listen IP": "MQTT Listen IP",
    "MQTT Password": "Mot de passe MQTT",
    "MQTT Username": "Nom d'utilisateur MQTT",
    "MQTT and HTTP": "MQTT et HTTP",
    "MQTT settings": "Paramètres MQTT",
    "Poll time in seconds": "Temps d'interrogation en secondes",
    "Shelly devices that shall not be displayed. Enter device id of Shelly like 8B22BD": "Périphériques Shelly qui ne doivent pas être affichés .. Entrez l'identifiant de périphérique de Shelly comme 8B22BD",
    "Shelly protocol": "Protocole Shelly",
    "Update objects even if there is no value change": "Mettre à jour les objets même s'il n'y a pas de changement de valeur",
    "Log Debug Messages": "Consigner les messages de débogage",
    "You have to configure the same password on all devices": "Vous devez configurer le même mot de passe sur tous les appareils",
    "Save HTTP responses (for debugging)": "Enregistrer les réponses HTTP (pour le débogage)",
    "CoAP ist supported by Gen1 devices, MQTT is supported by all devices (Gen1 and Gen2)": "CoAP est pris en charge par les appareils Gen1, MQTT est pris en charge par tous les appareils (Gen1 et Gen2)",
    "Must be configured on all Shelly devices": "Doit être configuré sur tous les appareils Shelly",
    "Will be used to authenticate against generation 1 devices": "Sera utilisé pour s'authentifier auprès des appareils de génération 1",
    "User credentials for restricted login": "Informations d'identification de l'utilisateur pour une connexion restreinte",
    "Custom options": "Options personnalisées",
    "Debugging (expert options)": "Débogage (options expertes)",
    "MQTT Server options": "Options du serveur MQTT"
}
